app/Controllers/Admin/Dashboard.php

    public function index()
    {
        // Memeriksa apakah pengguna sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login'); // Arahkan ke halaman login jika belum login
        }

        // Mengambil data dari model
        $siswaModel = new SiswaModel();
        $guruModel = new GuruModel();
        $kelasModel = new KelasModel();
        $petugasModel = new PetugasModel();
        $pengaturanModel = new PengaturanModel();
        $kehadiranModel = new KehadiranModel();
        $absensiSiswaModel = new AbsensiSiswaModel();
        $absensiGuruModel = new AbsensiGuruModel();  // Model Absensi Guru

        // Hitung jumlah siswa dan guru
        $data['jumlah_siswa'] = $siswaModel->countSiswa();
        $data['jumlah_guru'] = $guruModel->countGuru();
        $data['jumlah_kelas'] = $kelasModel->countKelas();
        $data['jumlah_petugas'] = $petugasModel->countPetugas();

        // Ambil tanggal hari ini
        $tanggal = date('Y-m-d');

        // Mengambil data absensi untuk siswa hari ini
        $absensiSiswaHariIni = $absensiSiswaModel
            ->select('kehadiran_id')
            ->where('tanggal', $tanggal)
            ->findAll();
---
SELECT `kehadiran_id`
FROM `absensi_siswa`
WHERE `tanggal` = '2025-04-12'

        $data['alfa_count_guru'] = $alfaCountGuru;

        // Menampilkan view dashboard
        $tahunAjaran = $pengaturanModel->first();
        $data['tahun_ajaran'] = $tahunAjaran['tahun_ajaran'];
        $data['nama_sekolah'] = $pengaturanModel->first()['nama_sekolah'];
---
SELECT *
FROM `pengaturan`
 LIMIT 1


        for ($i = 6; $i >= 0; $i--) {
            $tanggal = date('Y-m-d', strtotime("-$i days"));
            $absensiSiswaHariIni = $absensiSiswaModel->select('kehadiran_id')->where('tanggal', $tanggal)->findAll();
---
SELECT `kehadiran_id`
FROM `absensi_siswa`
WHERE `tanggal` = '2025-04-06'


        for ($i = 6; $i >= 0; $i--) {
            $tanggal = date('Y-m-d', strtotime("-$i days"));
            $absensiGuruHariIni = $absensiGuruModel->select('kehadiran_id')->where('tanggal', $tanggal)->findAll();
---
SELECT `kehadiran_id`
FROM `absensi_guru`
WHERE `tanggal` = '2025-04-06'