app/Controllers/Absensi/AbsensiGuru.php

SELECT *
FROM `guru`
SELECT *
FROM `pengaturan`
 LIMIT 1
SELECT *
FROM `kehadiran`
---
        }

        $data['absensi_guru'] = $absensiQuery->findAll();
        $data['guru'] = !$keyword ? $guruModel->findAll() : $guruModel->like('nuptk', $keyword)
            ->orLike('nama_guru', $keyword)
            ->findAll();
        $data['tahun_ajaran'] = $pengaturanModel->first()['tahun_ajaran'];
        $data['kehadiran'] = $kehadiranModel->findAll();