app/Controllers/Absensi/AbsensiSiswa.php

SELECT *
FROM `pengaturan`
 LIMIT 1
SELECT *
FROM `kehadiran`
---
        $data['absensi_siswa'] = $absensiQuery->findAll();

        // Ambil data lainnya yang dibutuhkan (misalnya kelas, jurusan, dsb.)
        $data['tahun_ajaran'] = $pengaturanModel->first()['tahun_ajaran'];
        $data['kehadiran'] = $kehadiranModel->findAll();