app/Controllers/Data/DataGuru.php

SELECT *
FROM `pengaturan`
 LIMIT 1
SELECT *
FROM `guru`
ORDER BY `nuptk` ASC
---
    public function index()
    {
        // Memeriksa apakah pengguna sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login'); // Arahkan ke halaman login jika belum login
        }
        $guruModel = new GuruModel();
        $pengaturanModel = new PengaturanModel();

        // Ambil data tahun ajaran
        $tahunAjaran = $pengaturanModel->first();
        $data['tahun_ajaran'] = $tahunAjaran['tahun_ajaran'];

        // Ambil keyword pencarian jika ada
        $keyword = $this->request->getGet('keyword'); // Misalnya 'keyword' untuk pencarian nama atau nuptk

        if ($keyword) {
            // Menambahkan kondisi pencarian untuk nama atau NUPTK
            $data['guru'] = $guruModel->groupStart() // Mulai pencarian
                ->like('nama_guru', $keyword) // Mencari berdasarkan nama guru
                ->orLike('nuptk', $keyword) // Mencari berdasarkan NUPTK
                ->groupEnd() // Akhiri pencarian
                ->orderBy('nuptk', 'ASC') // Urutkan berdasarkan NUPTK secara ascending
                ->findAll();
        } else {
            // Jika tidak ada keyword, ambil semua data guru dan urutkan berdasarkan NUPTK
            $data['guru'] = $guruModel->orderBy('nuptk', 'ASC')->findAll();

SELECT *
FROM `guru`
WHERE `nuptk` = '1247928349017232'
 LIMIT 1
---
    public function simpan()
    {
        $guruModel = new GuruModel();
        $nuptk = $this->request->getPost('nuptk');
        $jenisKelamin = $this->request->getPost('jenis_kelamin');

        // Validasi NUPTK
        $validationError = $this->validateNuptk($nuptk);
        if ($validationError) {
            return redirect()->back()->with('error', $validationError)->withInput();
        }

        // Memeriksa apakah NUPTK sudah terdaftar
        $existingGuru = $guruModel->where('nuptk', $nuptk)->first();

INSERT INTO `guru` (`nama_guru`, `nuptk`, `jenis_kelamin`, `no_hp`, `alamat`) VALUES ('Nur Intan Permatasari', '1247928349017232', 'Perempuan', '082394578330', 'Pasarwajo Batumatongka')
---
        ];

        // Menyimpan data ke database
        $guruModel->save($data);