app/Controllers/Data/DataSiswa.php

SELECT *
FROM `kelas`
SELECT *
FROM `jurusan`
SELECT *
FROM `pengaturan`
 LIMIT 1
SELECT `kelas`.`id`, `kelas`.`nama_kelas`, `jurusan`.`jurusan` as `jurusan`
FROM `kelas`
LEFT JOIN `jurusan` ON `jurusan`.`id` = `kelas`.`jurusan_id`
---
    public function index()
    {
        // Memeriksa apakah pengguna sudah login
        if (!session()->get('logged_in')) {
            return redirect()->to('/auth/login'); // Arahkan ke halaman login jika belum login
        }
        $siswaModel = new SiswaModel();
        $kelasModel = new KelasModel();
        $jurusanModel = new JurusanModel();
        $pengaturanModel = new PengaturanModel();

        // Ambil data kelas dan jurusan
        $data['kelas'] = $kelasModel->findAll();
        $data['jurusan'] = $jurusanModel->findAll();
        $tahunAjaran = $pengaturanModel->first();
        $data['tahun_ajaran'] = $tahunAjaran['tahun_ajaran'];

        // Ambil data kelas dan jurusan
        $data['kelas'] = $kelasModel->findAll();
        $data['jurusan'] = $jurusanModel->findAll();


        $data['kelas'] = $kelasModel->select('kelas.id, kelas.nama_kelas, jurusan.jurusan as jurusan')
            ->join('jurusan', 'jurusan.id = kelas.jurusan_id', 'left')
            ->findAll();