app/Controllers/AuthController.php

    public function createAccount()
    {
        $username = $this->request->getPost('username');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Validasi input
        if (empty($username) || empty($email) || empty($password)) {
            return redirect()->back()->with('error', 'Semua field harus diisi.')->withInput();
        }

        // Cek apakah email sudah ada di database
        if ($this->userModel->where('email', $email)->first()) {
            return redirect()->back()->with('error', 'Email sudah terdaftar')->withInput();
        }

        // Validasi password
        if (strlen($password) < 8 || !preg_match('/[A-Z]/', $password) || !preg_match('/[a-z]/', $password) || !preg_match('/[0-9]/', $password)) {
            return redirect()->back()->with('error', 'Password harus minimal 8 karakter, mengandung huruf besar, huruf kecil, dan angka.')->withInput();
        }

        // Simpan pengguna baru
        $dataToInsert = [
            'username' => $username,
            'email' => $email,
            'password_hash' => password_hash($password, PASSWORD_BCRYPT),
        ];

        if ($this->userModel->insert($dataToInsert)) {
---
SELECT *
FROM `users`
WHERE `email` = 'kutuloncat512@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
INSERT INTO `users` (`username`, `email`, `password_hash`, `created_at`, `updated_at`) VALUES ('Idil Ode122', 'kutuloncat512@gmail.com', '$2y$10$cD44blBTtZesuqyvwISbseSj8SF.fdKUS2RDBLGL7R2UZz0Lh3ZhC', '2025-04-12 10:02:48', '2025-04-12 10:02:48')

    public function googleCallback()
    {
        $client = new \Google\Client();
        $client->setClientId('790238117272-eq8fj3vr6bpktei08adgmipike0ssa6u.apps.googleusercontent.com');
        $client->setClientSecret('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');
        $client->setRedirectUri('http://localhost/absensi_qr/public/auth/googleCallback');

        $code = $this->request->getVar('code');

        if (empty($code)) {
            return redirect()->to('auth/login')->with('error', 'Login Google dibatalkan.');
        }

        $token = $client->fetchAccessTokenWithAuthCode($code);
        $client->setAccessToken($token['access_token']);

        $oauth = new \Google\Service\Oauth2($client);
        $userInfo = $oauth->userinfo->get();

        $user = $this->userModel->where('email', $userInfo->email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'idilode350@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1