app/Models/GuruModel.php

    public function countGuru()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `guru`