app/Models/KelasModel.php

    public function getJurusan()
    {
        return $this->join('jurusan', 'jurusan.id = kelas.jurusan_id', 'left')
            ->select('kelas.*, jurusan.jurusan')
            ->findAll();
---
SELECT `kelas`.*, `jurusan`.`jurusan`
FROM `kelas`
LEFT JOIN `jurusan` ON `jurusan`.`id` = `kelas`.`jurusan_id`

    public function countKelas()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kelas`