app/Models/SiswaModel.php

    public function countSiswa()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `siswa`